Обо мне:

Я 6 лет изучаю IT. За это время освоил следующие направления:

 - по Java:
основы java-core, немножко jdbc, немножко spring / spring-boot, немножко http-servlets, немножко maven/gradle, немножко liquibase, немножко Junit5, немножко Hibernate

 - по Python:
 основы. Синтаксис, основные операторы и структуры. Асинхронное программирование на Python НЕ ЗНАЮ.

 - по DevOps:
знаю основы Kubernetes и Helm, работаю с админкой OpenShift, знаю, что такое Nexus/Registry, время от времени работаю с Kafka, понимаю Docker, знаю основы Ansible, работаю с Jenkins

 - другие языки программирования:
SQL (продвинутый), основы Bash

 - по Linux:
знаю Linux на уровне продвинутого пользователя коммандной строки в объеме, достаточном для выполнения основных операций с файлами, процессами, запуском приложений, правами и доступами

 - по сетям:
знаю основы Cisco CCNA

 - разные IDE:
умею работать в IntelliJ IDEA, PyCharm, VS Code

 - по мониторингу:
сталкивался с Prometheus и Grafana, но не знаю как их поднимать и настраивать с нуля.

 - по Git:
умею работать с GitHub, BitBucket

понимание архитектуры компьютера, базовые знания по ассемблеру;

English: B1
